#### LoadCombinationType Enumeration

---

|  |
| --- |
| See Also |

Specifies load combination type.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum LoadCombinationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LoadCombinationType ``` |

| Visual C++ |
| --- |
| ``` public enum class LoadCombinationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Combination | Combination |
| Envelope | Envelope |

# See Also

Autodesk.Revit.DB.Structure Namespace